# Import Libraries

In [1]:
# imports numpy, pandas, & os
import numpy as np
import pandas as pd
import os

# Import Data Sets

In [2]:
#import data sets
path = r'/Users/oliviamurphy/Desktop/2022-01 Insta Cart Analysis'
df_ords= pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)
df_dep = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'departments.csv'), index_col = False)
df_ords_prods_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'order_products__prior.csv'), index_col = False)
df_cust= pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

# Exploration

## df_ords (exploration)

In [3]:
# outputs variable names
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 7 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   order_dow               int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
dtypes: float64(1), int64(5), object(1)
memory usage: 182.7+ MB

In [4]:
# checks shape of df_ords
df_ords.shape

(3421083, 7)

In [5]:
# outputs descriptive stats for numerical variables
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [6]:
# outputs value counts for df_ords['order_dow']
df_ords['order_dow'].value_counts(dropna = False).sort_index()

0    600905
1    587478
2    467260
3    436972
4    426339
5    453368
6    448761
Name: order_dow, dtype: int64

In [7]:
# outputs value counts for df_ords['order_hour_of_day']
df_ords['order_hour_of_day'].value_counts(dropna = False).sort_index()

0      22758
1      12398
2       7539
3       5474
4       5527
5       9569
6      30529
7      91868
8     178201
9     257812
10    288418
11    284728
12    272841
13    277999
14    283042
15    283639
16    272553
17    228795
18    182912
19    140569
20    104292
21     78109
22     61468
23     40043
Name: order_hour_of_day, dtype: int64

In [8]:
# outputs value counts for df_ords['days_since_prior_order']
df_ords['days_since_prior_order'].value_counts(dropna = False).sort_index()

0.0      67755
1.0     145247
2.0     193206
3.0     217005
4.0     221696
5.0     214503
6.0     240013
7.0     320608
8.0     181717
9.0     118188
10.0     95186
11.0     80970
12.0     76146
13.0     83214
14.0    100230
15.0     66579
16.0     46941
17.0     39245
18.0     35881
19.0     34384
20.0     38527
21.0     45470
22.0     32012
23.0     23885
24.0     20712
25.0     19234
26.0     19016
27.0     22013
28.0     26777
29.0     19191
30.0    369323
NaN     206209
Name: days_since_prior_order, dtype: int64

In [9]:
# outputs first five rows of df_ords
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

## df_prods (Exploration)

In [10]:
# outputs variables for df_prods
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int64
 1   product_name   49677 non-null  object
 2   aisle_id       49693 non-null  int64
 3   department_id  49693 non-null  int64
 4   prices         49693 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.9+ MB

In [11]:
# checks shape of df_prods.
df_prods.shape

(49693, 5)

In [12]:
# outputs descriptive stats for df_prods
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [13]:
# outputs value counts for df_prods['department_id']
df_prods['department_id'].value_counts(dropna = False).sort_index()

1     4007
2      548
3     1516
4     1684
5     1056
6     1139
7     4365
8      972
9     1858
10      38
11    6565
12     907
13    5371
14    1116
15    2092
16    3449
17    3085
18    1081
19    6264
20    1322
21    1258
Name: department_id, dtype: int64

In [14]:
# outputs value counts for df_prods['aisle_id']
df_prods['aisle_id'].value_counts(dropna = False).sort_index()

1      146
2      271
3      832
4      543
5      409
      ...
130    303
131    457
132    178
133    172
134     95
Name: aisle_id, Length: 134, dtype: int64

In [15]:
# outputs first five rows of df_prods
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

## df_dep (Exploration)

In [16]:
# prints first five rows of df_dep (needs to be transposed)
## please jump to transpose section to see further exploration & steps
df_dep.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   department_id  1 non-null      object
 1   1              1 non-null      object
 2   2              1 non-null      object
 3   3              1 non-null      object
 4   4              1 non-null      object
 5   5              1 non-null      object
 6   6              1 non-null      object
 7   7              1 non-null      object
 8   8              1 non-null      object
 9   9              1 non-null      object
 10  10             1 non-null      object
 11  11             1 non-null      object
 12  12             1 non-null      object
 13  13             1 non-null      object
 14  14             1 non-null      object
 15  15             1 non-null      object
 16  16             1 non-null      object
 17  17             1 non-null      object
 18  18             1 non-null      object
 19  19             1 non-null      object
 20  20             1 non-null      object
 21  21             1 non-null      object
dtypes: object(22)
memory usage: 304.0+ bytes

In [17]:
# checks shape of df_dep
df_dep.shape

(1, 22)

 ## df_ords_prods_prior (Exploration)

In [18]:
# outputs variable info for df_ords_prods_prior
df_ords_prods_prior.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           int64
 1   product_id         int64
 2   add_to_cart_order  int64
 3   reordered          int64
dtypes: int64(4)
memory usage: 989.8 MB

In [19]:
# outputs descriptive stats for df_ords_prods_prior
df_ords_prods_prior.describe()

           order_id    product_id  add_to_cart_order     reordered
count  3.243449e+07  3.243449e+07       3.243449e+07  3.243449e+07
mean   1.710749e+06  2.557634e+04       8.351076e+00  5.896975e-01
std    9.873007e+05  1.409669e+04       7.126671e+00  4.918886e-01
min    2.000000e+00  1.000000e+00       1.000000e+00  0.000000e+00
25%    8.559430e+05  1.353000e+04       3.000000e+00  0.000000e+00
50%    1.711048e+06  2.525600e+04       6.000000e+00  1.000000e+00
75%    2.565514e+06  3.793500e+04       1.100000e+01  1.000000e+00
max    3.421083e+06  4.968800e+04       1.450000e+02  1.000000e+00

In [20]:
# first five rows for df_ords_prods_prior
df_ords_prods_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

## df_cust (Exploration)

In [21]:
# outputs variable info for df_cust
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [22]:
# checks shape of df_cust
df_cust.shape

(206209, 10)

In [23]:
# outputs descriptive stats for numerical variables in df_cust
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [24]:
# outputs value counts for df_cust['Gender']
df_cust['Gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: Gender, dtype: int64

In [25]:
# outputs value counts for df_cust['Age']
df_cust['Age'].value_counts(dropna = False).sort_index

<bound method Series.sort_index of 19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64>

In [26]:
# outputs value counts for df_cust['STATE']
df_cust['STATE'].value_counts(dropna = False).sort_index()

Alabama                 4044
Alaska                  4044
Arizona                 4044
Arkansas                4044
California              4044
Colorado                4044
Connecticut             4044
Delaware                4044
District of Columbia    4044
Florida                 4044
Georgia                 4044
Hawaii                  4044
Idaho                   4044
Illinois                4044
Indiana                 4044
Iowa                    4044
Kansas                  4043
Kentucky                4043
Louisiana               4043
Maine                   4043
Maryland                4043
Massachusetts           4043
Michigan                4043
Minnesota               4043
Mississippi             4043
Missouri                4043
Montana                 4043
Nebraska                4043
Nevada                  4043
New Hampshire           4043
New Jersey              4043
New Mexico              4043
New York                4043
North Carolina          4043
North Dakota            4043
Ohio                    4043
Oklahoma                4043
Oregon                  4043
Pennsylvania            4043
Rhode Island            4043
South Carolina          4043
South Dakota            4043
Tennessee               4043
Texas                   4043
Utah                    4043
Vermont                 4043
Virginia                4043
Washington              4043
West Virginia           4043
Wisconsin               4043
Wyoming                 4043
Name: STATE, dtype: int64

In [27]:
# outputs value counts for df_cust['fam_status']
df_cust['fam_status'].value_counts(dropna = False).sort_index

<bound method Series.sort_index of married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64>

In [28]:
# outputs value counts for df_cust['n_dependants']
df_cust['n_dependants'].value_counts(dropna = False).sort_index()

0    51602
1    51531
2    51482
3    51594
Name: n_dependants, dtype: int64

# Data Wrangling
## Dropping Columns

In [29]:
#drop cols from orders df
df_ords.drop(columns = ['eval_set'])
#saves dropped cols from orders
df_ords = df_ords.drop(columns = ['eval_set'])

In [30]:
#call for orders df w/o dropped cols
df_ords

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [31]:
# drops columns from df_cust
df_cust = df_cust.drop(columns = ['First Name', 'Surnam'])

In [32]:
# checks for dropped columns
df_cust.head()

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

# Data Wrangling
## Find the frequency of a variable

In [33]:
df_ords['days_since_prior_order'].value_counts(dropna = False).sort_index()

0.0      67755
1.0     145247
2.0     193206
3.0     217005
4.0     221696
5.0     214503
6.0     240013
7.0     320608
8.0     181717
9.0     118188
10.0     95186
11.0     80970
12.0     76146
13.0     83214
14.0    100230
15.0     66579
16.0     46941
17.0     39245
18.0     35881
19.0     34384
20.0     38527
21.0     45470
22.0     32012
23.0     23885
24.0     20712
25.0     19234
26.0     19016
27.0     22013
28.0     26777
29.0     19191
30.0    369323
NaN     206209
Name: days_since_prior_order, dtype: int64

# Renaming Columns

In [34]:
#renaming columns
df_ords.rename(columns = {'order_dow':'orders_day_of_week', 'days_since_prior_order': 'days_passed_since_last_order'}, inplace=True)

In [35]:
#check for renamed col
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_passed_since_last_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [36]:
# renames columns in df_cust
df_cust.rename(columns = {'STATE': 'state', 'Age': 'age', 'Gender': 'gender', 'fam_status': 'family_status', 'n_dependants': 'number_of_dependants'}, inplace = True)

In [37]:
# checks for renames columns
df_cust.head()

,user_id,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

# Data Wrangling
## Changing a variable's data type

In [38]:
# save df_ords['order_id'] as string
df_ords['order_id'] = df_ords['order_id'].astype('string')

In [39]:
# checks new datatype
df_ords['order_id'].dtype

string[python]

In [40]:
# save df_ords['user_id'] as string
df_ords['user_id'] = df_ords['user_id'].astype('string')

In [41]:
# checks new datatype
df_ords['user_id'].dtype

string[python]

In [42]:
# save df_prods['aisle_id'] as string
df_prods['aisle_id'] = df_prods['aisle_id'].astype('string')

In [43]:
# checks new datatype
df_prods['aisle_id'].dtype

string[python]

In [44]:
# save df_prods['department_id'] as string
df_prods['department_id'] = df_prods['department_id'].astype('string')

In [45]:
# checks new datatype
df_prods['department_id'].dtype

string[python]

In [46]:
# save df_ords_prods_prior['order_id'] as string
df_ords_prods_prior['order_id'] = df_ords_prods_prior['order_id'].astype('string')

In [47]:
# checks new datatype
df_ords_prods_prior['order_id'].dtype

string[python]

In [48]:
# save df_ords_prods_prior['product_id'] as string
df_ords_prods_prior['product_id'] = df_ords_prods_prior['product_id'].astype('string')

In [49]:
# checks new datatype
df_ords_prods_prior['product_id'].dtype

string[python]

In [50]:
# save df_cust['user_id'] as string
df_cust['user_id'] = df_cust['user_id'].astype('string')

In [51]:
# checks new datatype
df_cust['user_id'].dtype

string[python]

# Data Wrangling
## Transposing Data

In [52]:
#what data that needs to be transposed looks like
df_dep.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [53]:
#transposing the data
df_dep.T

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [54]:
df_dep_T =df_dep.T

In [55]:
#resetting the index
df_dep_T.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [56]:
#saving the header
new_header = df_dep_T.iloc[0]

In [57]:
#print the new header
new_header

0    department
Name: department_id, dtype: object

In [58]:
#create new df without first row
df_dep_T_new = df_dep_T[1:]

In [59]:
#check new df
df_dep_T_new

                  0
1            frozen
2             other
3            bakery
4           produce
5           alcohol
6     international
7         beverages
8              pets
9   dry goods pasta
10             bulk
11    personal care
12     meat seafood
13           pantry
14        breakfast
15     canned goods
16       dairy eggs
17        household
18           babies
19           snacks
20             deli
21          missing

In [60]:
#creating new header
df_dep_T_new.columns = new_header

In [61]:
#check for header 
df_dep_T_new

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

## df_dep_T_new (Exploration)

In [62]:
# outputs variables for df_dep_T_new
df_dep_T_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 21 entries, 1 to 21
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   department  21 non-null     object
dtypes: object(1)
memory usage: 336.0+ bytes

In [63]:
# outputs descriptive stats for df_dep_T_new
df_dep_T_new.describe()

department_id department
count                 21
unique                21
top               frozen
freq                   1

# Data Dictionaries

In [64]:
#creating a data dictionary
data_dict = df_dep_T_new.to_dict('index')

In [65]:
#calling the dictionary
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

In [66]:
#data dict in practice 1/2
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [67]:
#data dict in practice 2/2
print(data_dict.get('19'))

{'department': 'snacks'}

# Check Shapes

In [68]:
# Checks shape for df_ords
df_ords.shape

(3421083, 6)

In [69]:
# Checks shape for df_prods
df_prods.shape

(49693, 5)

In [70]:
# Checks shape for df_ords_prods_prior
df_ords_prods_prior.shape

(32434489, 4)

In [71]:
# Checks shape for df_dep_T_new
df_dep_T_new.shape

(21, 1)

In [72]:
# Checks shape for df_cust
df_cust.shape

(206209, 8)

# Export Data

In [ ]:
#exports wrangled data
df_ords.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'ords_wrangled.csv'))
df_dep_T_new.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'dep_wrangled.csv'))
df_cust.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'cust_wrangled.csv'))
df_prods.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'prods_wrangled.csv'))
df_ords_prods_prior.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'df_ords_prods_prior_wrangled.csv'))